---
kind: method
id: M:Autodesk.Revit.DB.RoutingPreferenceManager.GetNumberOfRules(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType)
source: html/dc9ff84a-f93d-5145-8f8f-36aa049723f6.htm
---
# Autodesk.Revit.DB.RoutingPreferenceManager.GetNumberOfRules Method

The number of RoutingPreference rules in a group.

## Syntax (C#)
```csharp
public int GetNumberOfRules(
	RoutingPreferenceRuleGroupType eGroupType
)
```

## Parameters
- **eGroupType** (`Autodesk.Revit.DB.RoutingPreferenceRuleGroupType`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration